const currentServices = {
    "subscription-services": {
      hero: {
        title: 'Абонаментно Обслужване за Вашия Бизнес',
        description: 'Оптимизирайте вашите счетоводни и финансови процеси с нашите персонализирани абонаментни услуги.',
        image: '/hero.png'
      },
      description: {
        title: 'Комплексно Абонаментно Обслужване',
        text: 'Нашите абонаментни услуги са специално разработени, за да подпомогнат бизнеса ви да расте без да се притеснявате за счетоводството и данъците.',
        bullets: [
          'Месечно счетоводство и финансов анализ',
          'Данъчно планиране и подаване на декларации',
          'Управление на заплати и социални осигуровки',
          'Консултации за оптимизация на финансовите процеси',
          'Анализ и препоръки за управление на парични потоци',
          'Планиране и консултации за финансови стратегии',
          'Поддръжка при въвеждане на финансови софтуерни решения'
        ]
      },
      seo: {
        title: 'Абонаментно Счетоводно Обслужване | Вашата Фирма',
        metaDescription: 'Осигурете ефективност и растеж на вашето предприятие с нашите абонаментни счетоводни и данъчни услуги, адаптирани към нуждите на вашето бизнес развитие.',
        keywords: 'абонаментно счетоводство, данъчно планиране, управление на заплати, финансови консултации, оптимизация на бизнес процеси'
      }
    },
    "annual-closure-services": {
      hero: {
        title: 'Годишно Приключване на Сметки',
        description: 'Завършете финансовата година с яснота и точност чрез нашите услуги за годишно приключване.',
        image: '/hero.png'
      },
      description: {
        title: 'Услуги за Годишно Приключване',
        text: 'Нашият професионален екип е тук, за да ви подпомогне в процеса на годишно приключване, гарантирайки точност и съответствие със законовите изисквания.',
        bullets: [
          'Подготовка на годишни финансови отчети',
          'Анализ на финансовите резултати',
          'Консултации за подобрения и стратегическо планиране'
        ]
      },
      seo: {
        title: 'Годишно Приключване на Сметки | Вашата Фирма',
        metaDescription: 'Гарантирайте точност и съответствие с законовите изисквания при годишното приключване на сметки с нашите професионални услуги.',
        keywords: 'годишно приключване, финансови отчети, счетоводни услуги, анализ на резултати, стратегическо планиране'
      }
    },
    "hr-services": {
      hero: {
        title: 'Управление на Човешките Ресурси и Заплати',
        description: 'Максимизирайте ефективността на вашите HR и заплатни процеси с нашата професионална подкрепа.',
        image: '/hero.png'
      },
      description: {
        title: 'Комплексни HR Услуги',
        text: 'Предоставяме цялостно управление на човешките ресурси и заплати, облекчавайки административния товар и повишавайки удовлетвореността на служителите.',
        bullets: [
          'Създаване на трудови договори',
          'Обработка на заплати и данъчни декларации',
          'Консултации по трудово и социално законодателство'
        ]
      },
      seo: {
        title: 'HR и Управление на Заплати | Вашата Фирма',
        metaDescription: 'Оптимизирайте HR процесите и управлението на заплати с нашите интегрирани услуги, предназначени да подобрят ефективността и съответствието.',
        keywords: 'HR услуги, управление на заплати, трудови договори, данъчни декларации, консултации по трудово право'
      }
    },
    "quarterly-service": {
        hero: {
          title: 'Тримесечно Счетоводно Обслужване',
          description: 'Идеално за бизнеси с по-малък обем на операции, нашите тримесечни пакети предлагат гъвкаво и цялостно обслужване.',
          image: '/hero.png'
        },
        description: {
          title: 'Включени Услуги в Тримесечния Пакет',
          text: 'Нашите тримесечни услуги са разработени да осигуряват цялостно и периодично обслужване, адаптирано към уникалните нужди на вашето предприятие.',
          bullets: [
            'Изготвяне на месечни и годишни финансови отчети',
            'Подготовка и подаване на данъчни декларации за данъци и такси',
            'Водене на счетоводство и складово стопанство',
            'Консултации по счетоводни и данъчни въпроси',
            'Поддържане и актуализиране на персоналния регистър'
          ]
        },
        seo: {
          title: 'Тримесечно Счетоводно Обслужване | Вашата Фирма',
          metaDescription: 'Нашите тримесечни счетоводни услуги предлагат гъвкаво решение за бизнеси с по-малък обем на операции, гарантирайки вашето спокойствие и съответствие.',
          keywords: 'тримесечно счетоводство, счетоводни услуги, финансови отчети, данъчно обслужване, консултации по счетоводство'
        }
      }
      
    // More services can be added following this structure.
  }


export default currentServices;