const currentServices = {
    "subscription-services" :{
        hero: {
            title: 'Абонаментно обслужване',
            description: 'Възползвайте се от модерните решения за счетоводство и данъчни услуги, които предлагаме, за да оптимизирате вашите финансови процеси и да се съсредоточите върху растежа на вашето вашия бизнес.',
            image: '/hero.png'
        },
        description:{
            title: 'Какво включва нашият абонаментен пакет:',
            text: 'Нашата цел е да ви освободим от административните бремена на счетоводството, така че вие да можете да се съсредоточите върху растежа и успеха на вашия бизнес. С нас, вие получавате не просто счетоводен партньор, а надежден съюзник във вашата бизнес стратеги',
            bullets: [
                'Изготвяне на месечни счетоводни отчети и анализ на финансовото състояние на вашия бизнес.',
                'Таксово планиране и подготовка на данъчни декларации, гарантиращи вашата съответност с българското данъчно законодателство.',
                'Управление на заплатите и социалните осигуровки, включително изготвяне на трудови договори и ведомости за заплати.',
                'Съвети и консултации за оптимизиране на финансовите процеси и подобряване на финансовата ефективност на вашия бизнес',
            ]
        },
        seo: {
            title: 'Абонаментно счетоводно обслужване | Актив ООД',
            metaDescription: 'Получете цялостни абонаментни счетоводни и данъчни услуги от Актив ООД, за да оптимизирате финансите на вашето предприятие и да се съсредоточите върху растежа на бизнеса си в Сандански и България.',
            keywords: 'абонаментно счетоводство, данъчни услуги, оптимизация на финанси, бизнес развитие, счетоводни услуги Сандански'
          }
    },
    "annual-closure" :{
        hero: {
            title: 'Данъчни и Съответствени Услуги',
            description: 'Нашият екип от данъчни експерти предлага специализирани услуги за данъчно планиране, деклариране и съответствие. Разбираме важността на правилното управление на данъците за вашето предприятие и работим усилено, за да ви осигурим най-добрите решения за вашите данъчни нужди.',
            image: '/hero.png'
        },
        description:{
            title: 'Наши услуги включват:',
            text: 'Абонатите на нашите услуги могат да се възползват от широк набор от експертни услуги, които предоставяме в рамките на договора:',
            bullets: [
                'Данъчно планиране и оптимизация за намаляване на данъчното бреме и максимизиране на вашите финансови ресурси.',
                'Подготовка и подаване на различни видове данъчни декларации, включително ДДС, корпоративен доход, личен доход и други.',
                'Консултации относно данъчни въпроси и съответствие със законодателството на България.',
                'Представителство пред данъчните органи и помощ при данъчни проверки и спорове.',
            ]
        },
        seo: {
            title: 'Данъчни и Съответствени Услуги | Актив ООД',
            metaDescription: 'Разчитайте на експертите на Актив ООД за професионално данъчно планиране, деклариране и съответствие, за да гарантирате, че вашето предприятие отговаря на всички данъчни изисквания в България.',
            keywords: 'данъчно планиране, данъчно съответствие, данъчни услуги, данъчни декларации, счетоводство Сандански'
          }
    },
    "hr-services" :{
        hero: {
            title: 'Управление на Човешките Ресурси и Заплатите',
            description: 'Нашата компания предлага пълна гама от услуги за управление на човешките ресурси и заплатите, предназначени да ви помогнат да улесните административните процеси и да се концентрирате върху развитието на вашия бизнес. Нашите специалисти са на разположение, за да ви подпомогнат във всички аспекти на управлението на персонала и заплатите.',
            image: '/hero.png'
        },
        description:{
            title: 'Нашите Услуги',
            text: 'Нашата цел е да ви предоставим надеждни и ефективни решения за управление на човешките ресурси и заплатите, които отговарят на специфичните нужди на вашия бизнес.',
            bullets: [
                'Създаване на трудови договори и други документи за наемане и уволнение на персонал.',
                'Обработка на заплати и данъци, включително изчисляване на социални осигуровки и данъци за доходите от труд.',
                'Подготовка и подаване на декларации за социално и здравно осигуряване.',
                'Консултации по въпроси на трудовото и социално законодателство.',
                'Водене на справки и поддръжка на персоналния регистър.',
            ]
        },
        seo: {
            title: 'Управление на Човешките Ресурси и Заплатите | Актив ООД',
            metaDescription: 'Използвайте нашите интегрирани услуги за управление на човешките ресурси и заплатите, за да подобрите ефективността и да намалите административните разходи за вашето предприятие в Сандански.',
            keywords: 'управление на човешки ресурси, обработка на заплати, трудови договори, социални осигуровки, HR услуги'
          }
    },
    "quarterly-service" :{
        hero: {
            title: 'Тримесечно Обслужване',
            description: 'Нашата тримесечна услуга е предназначена за клиенти, които търсят пълноценно счетоводно обслужване, но имат по-малък обем на операции и предпочитат периодични плащания. Този пакет включва широк спектър от счетоводни и данъчни услуги, които ще ви помогнат да се справите с административните изисквания на вашето предприятие.',
            image: '/hero.png'
        },
        description:{
            title: 'Включени услуги:',
            text: 'Този пакет предоставя нашия опитен екип да бъде на ваше разположение всеки квартал, гарантирайки ви, че вашите финансови задължения са изпълнени правилно и навреме.',
            bullets: [
                'Изготвяне на месечни и годишни финансови отчети.',
                'Подготовка и подаване на декларации за данъци и такси.',
                'Водене на счетоводство и складово стопанство.',
                'Консултации по счетоводни и данъчни въпроси.',
                'Водене на справки и поддръжка на персоналния регистър.',
            ]
        },
        seo: {
            title: 'Тримесечно Счетоводно Обслужване | Актив ООД',
            metaDescription: 'Нашето тримесечно счетоводно обслужване осигурява комплексно обслужване и консултации, които помагат на вашето предприятие да поддържа финансите си в ред и да се съобразява със законовите изисквания.',
            keywords: 'тримесечно счетоводство, счетоводно обслужване, финансови отчети, данъчни декларации, счетоводни консултации'
          }
    }
}


export default currentServices;