
const services =[
  {
    "id": "subscription-services",
    "name": "Абонаментно обслужване",
    "summary": {
      "name": "Абонаментно обслужване",
      "description": "Използвайте нашите абонаментни счетоводни и данъчни услуги за безпроблемно управление на финансите, докато се съсредоточите изцяло върху разширяването и растежа на вашето предприятие. Открийте гъвкавостта на планове, специално проектирани за нуждите на вашата фирма.",
      "descriptionShort" : "Открийте гъвкавостта на планове, специално проектирани за нуждите на вашата фирма.",
      "iconName": "Time",
      "image": {
       "src":  "/photos/medium/photo1.webp",
        "alt": "calculator"
      },
    },
    "pageData": {
      "hero": {
        "title": "Абонаментно Обслужване за Вашия Бизнес",
        "description": "Оптимизирайте вашите счетоводни и финансови процеси с нашите персонализирани абонаментни услуги.",
        "image": {
          "src":"/photos/large/photo1.webp",
          "alt": "bigimage1"
        }
      },
      "description": {
        "title": "Комплексно Абонаментно Обслужване",
        "text": "Нашите абонаментни услуги са специално разработени, за да подпомогнат бизнеса ви да расте без да се притеснявате за счетоводството и данъците.",
        "bullets": [
          { "text" :"Месечно счетоводство и финансов анализ", "iconName" : "Time" },
          { "text" :"Данъчно планиране и подаване на декларации", "iconName" : "Graph" },
          { "text" :"Управление на заплати и социални осигуровки", "iconName" : "User" },
          { "text" :"Консултации за оптимизация на финансовите процеси", "iconName" : "Idea" },
          { "text" :"Анализ и препоръки за управление на парични потоци", "iconName" : "Search" },
          { "text" :"Планиране и консултации за финансови стратегии", "iconName" : "Time" },
          { "text" :"Поддръжка при въвеждане на финансови софтуерни решения", "iconName" : "Support" },
        ]
      }
    },
    "seo": {
        "title": "Абонаментно Счетоводно Обслужване",
        "meta": [
          {
            "name": "description",
            "content":
              "Осигурете ефективност и растеж на вашето предприятие с нашите абонаментни счетоводни и данъчни услуги, адаптирани към нуждите на вашето бизнес развитие.",
          },
          {
            "name": "keywords",
            "content":
              "абонаментно счетоводство, данъчно планиране, управление на заплати, финансови консултации, оптимизация на бизнес процеси",
          },
        ],
        "link": [
            {
              "rel": "canonical",
              "href": "https://aktiv.bg/Services/subscription-services",
            },
          ],
      }
  },
  {
    "id": "annual-closure",
    "name": "Годишно счетоводно приключване",
    "summary": {
      "name": "Годишно счетоводно приключване",
      "description": "Нашите услуги за годишно приключване са тук, за да гарантират, че вашата фирма завършва фискалната година с точни и законово съобразени финансови отчети. Възползвайте се от нашата експертност за спокойствие в края на всяка година.",
      "descriptionShort" : "Нашите услуги за годишно приключване са тук, за да гарантират, че вашата фирма завършва фискалната година с точни и законово съобразени финансови отчети.",
      "iconName": "Gear",
      "image": {
        "src":  "/photos/medium/photo2.webp",
         "alt": "Woman in accounting office"
       },
      "link": "/Services/annual-closure"
    },
    "pageData": {
      "hero": {
        "title": "Годишно Приключване на Сметки",
        "description": "Завършете финансовата година с яснота и точност чрез нашите услуги за годишно приключване.",
        "image": {
          "src":"/photos/large/photo2.webp",
          "alt": "Woman in accounting office"
        }
      },
      "description": {
        "title": "Услуги за Годишно Приключване",
        "text": "Нашият професионален екип е тук, за да ви подпомогне в процеса на годишно приключване, гарантирайки точност и съответствие със законовите изисквания.",
        "bullets": [
          { "text" :"Подготовка на годишни финансови отчети", "iconName" : "Business" },
          { "text" :"Анализ на финансовите резултати", "iconName" : "Search" },
          { "text" :"Консултации за подобрения и стратегическо планиране" , "iconName" : "Idea" }
        ]
      },
    },
    "seo": {
        "title": "Годишно Приключване на Сметки",
        "meta": [
          {
            "name": "description",
            "content":
              "Гарантирайте точност и съответствие с законовите изисквания при годишното приключване на сметки с нашите професионални услуги.",
          },
          {
            "name": "keywords",
            "content":
              "годишно приключване, финансови отчети, счетоводни услуги, анализ на резултати, стратегическо планиране",
          },
        ],
        "link": [
            {
              "rel": "canonical",
              "href": "https://aktiv.bg/Services/annual-closure",
            },
          ],
    }
  },
  {
    "id": "hr-services",
    "name": "Обработка на заплати/ТРЗ услуги",
    "summary": {
      "name": "Обработка на заплати/ТРЗ услуги",
      "description": "Нашият екип предлага всеобхватна подкрепа в областта на трудовите и застрахователните въпроси, помагайки ви да управлявате заплатите и социалните приноси ефективно. Ние сме тук, за да улесним вашия административен товар и да оптимизираме вашите операции в ТРЗ.",
      "descriptionShort" : "Нашият екип предлага всеобхватна подкрепа в областта на трудовите и застрахователните въпроси, помагайки ви да управлявате заплатите и социалните приноси ефективно.",
      "iconName": "User",
      "image": {
        "src":  "/photos/medium/photo4.webp",
         "alt": "calculator"
       },
      "link": "/Services/hr-services"
    },
    "pageData": {
      "hero": {
        "title": "Управление на Човешките Ресурси и Заплати",
        "description": "Максимизирайте ефективността на вашите HR и заплатни процеси с нашата професионална подкрепа.",
        "image": {
          "src":"/photos/large/photo4.webp",
          "alt": "Woman in accounting office"
        }
      },
      "description": {
        "title": "Комплексни HR Услуги",
        "text": "Предоставяме цялостно управление на човешките ресурси и заплати, облекчавайки административния товар и повишавайки удовлетвореността на служителите.",
        "bullets": [
          { "text" :"Създаване на трудови договори", "iconName" : "Gear" },
          { "text" :"Обработка на заплати и данъчни декларации",  "iconName" : "Support-1" },
          { "text" :"Консултации по трудово и социално законодателство",  "iconName" : "User" },
        ]
      }
    },
    "seo": {
      "title": "HR и Управление на Заплати",
      "meta": [
        {
          "name": "description",
          "content":
            "Оптимизирайте HR процесите и управлението на заплати с нашите интегрирани услуги, предназначени да подобрят ефективността и съответствието.",
        },
        {
          "name": "keywords",
          "content":
            "HR услуги, управление на заплати, трудови договори, данъчни декларации, консултации по трудово право",
        },
      ],
      "link": [
          {
            "rel": "canonical",
            "href": "https://aktiv.bg/Services/hr-services",
          },
        ],
  }
  },
  {
    "id": "quarterly-service",
    "name": "Тримесечно Обслужване",
    "summary": {
      "name": "Тримесечно Обслужване",
      "description": "Нашето тримесечно счетоводно обслужване е идеално за предприятия, търсещи гъвкавост и надеждност, без да се налага постоянно внимание. Осигурете си спокойствие и съответствие със законовите изисквания с нашите персонализирани счетоводни решения.",
      "descriptionShort" : "Осигурете си спокойствие и съответствие със законовите изисквания с нашите персонализирани счетоводни решения.",
      "iconName": "Time",
      "image": {
        "src":  "/photos/medium/photo3.webp",
         "alt": "calculator"
       },
      "link": "/Services/quarterly-service"
    },
    "pageData": {
      "hero": {
        "title": "Тримесечно Счетоводно Обслужване",
        "description": "Идеално за бизнеси с по-малък обем на операции, нашите тримесечни пакети предлагат гъвкаво и цялостно обслужване.",
        "image": {
          "src":"/photos/large/photo3.webp",
          "alt": "bigimage1"
        }
      },
      "description": {
        "title": "Включени Услуги в Тримесечния Пакет",
        "text": "Нашите тримесечни услуги са разработени да осигуряват цялостно и периодично обслужване, адаптирано към уникалните нужди на вашето предприятие.",
        "bullets": [
          { "text" :"Изготвяне на месечни и годишни финансови отчети", "iconName" : "Time" },
          { "text" :"Подготовка и подаване на данъчни декларации за данъци и такси", "iconName" : "Business" },
          { "text" :"Водене на счетоводство и складово стопанство", "iconName" : "Support-1" },
          { "text" :"Консултации по счетоводни и данъчни въпроси", "iconName" : "Idea" },
          { "text" :"Поддържане и актуализиране на персоналния регистър" , "iconName" : "Support" }
        ]
      }
    },
    "seo": {
      "title": "Тримесечно Счетоводно Обслужване",
      "meta": [
        {
          "name": "description",
          "content":
            "Нашите тримесечни счетоводни услуги предлагат гъвкаво решение за бизнеси с по-малък обем на операции, гарантирайки вашето спокойствие и съответствие.",
        },
        {
          "name": "keywords",
          "content":
            "тримесечно счетоводство, счетоводни услуги, финансови отчети, данъчно обслужване, консултации по счетоводство",
        },
      ],
      "link": [
          {
            "rel": "canonical",
            "href": "https://aktiv.bg/Services/quarterly-service",
          },
        ],
  }
  }
  ]


export default defineEventHandler((event) => {

    const query = getQuery(event)
    let service
    if(Object.keys(query).length === 0){
      return services
    }

    if(query.type === "nav"){
      service = services.map(service => {
        return {id : service.id, name : service.name}
      })
    }

    if(query.type === "service"){
      service = services.find(service => service.id === query.id)
      service = { text : service?.pageData, seo : service?.seo }
    }


    return service
    })  