
const services =[
  {
    "id": "subscription-services",
    "name": "Абонаментно обслужване",
    "summary": {
      "name": "Абонаментно обслужване",
      "description": "Използвайте нашите абонаментни счетоводни и данъчни услуги за безпроблемно управление на финансите, докато се съсредоточите изцяло върху разширяването и растежа на вашето предприятие. Открийте гъвкавостта на планове, специално проектирани за нуждите на вашата фирма.",
      "icon": "/icons/Time.svg",
      "img": "/photos/photo1.webp",
      "link": "/Services/subscription-services"
    },
    "pageData": {
      "hero": {
        "title": "Абонаментно Обслужване за Вашия Бизнес",
        "description": "Оптимизирайте вашите счетоводни и финансови процеси с нашите персонализирани абонаментни услуги.",
        "image": "/hero.png"
      },
      "description": {
        "title": "Комплексно Абонаментно Обслужване",
        "text": "Нашите абонаментни услуги са специално разработени, за да подпомогнат бизнеса ви да расте без да се притеснявате за счетоводството и данъците.",
        "bullets": [
          "Месечно счетоводство и финансов анализ",
          "Данъчно планиране и подаване на декларации",
          "Управление на заплати и социални осигуровки",
          "Консултации за оптимизация на финансовите процеси",
          "Анализ и препоръки за управление на парични потоци",
          "Планиране и консултации за финансови стратегии",
          "Поддръжка при въвеждане на финансови софтуерни решения"
        ]
      }
    },
    "seo": {
      "title": "Абонаментно Счетоводно Обслужване | Вашата Фирма",
      "metaDescription": "Осигурете ефективност и растеж на вашето предприятие с нашите абонаментни счетоводни и данъчни услуги, адаптирани към нуждите на вашето бизнес развитие.",
      "keywords": "абонаментно счетоводство, данъчно планиране, управление на заплати, финансови консултации, оптимизация на бизнес процеси"
    }
  },
  {
    "id": "annual-closure",
    "name": "Годишно счетоводно приключване",
    "summary": {
      "name": "Годишно счетоводно приключване",
      "description": "Нашите услуги за годишно приключване са тук, за да гарантират, че вашата фирма завършва фискалната година с точни и законово съобразени финансови отчети. Възползвайте се от нашата експертност за спокойствие в края на всяка година.",
      "icon": "/icons/Gear.svg",
      "img": "/photos/photo2.webp",
      "link": "/Services/annual-closure"
    },
    "pageData": {
      "hero": {
        "title": "Годишно Приключване на Сметки",
        "description": "Завършете финансовата година с яснота и точност чрез нашите услуги за годишно приключване.",
        "image": "/hero.png"
      },
      "description": {
        "title": "Услуги за Годишно Приключване",
        "text": "Нашият професионален екип е тук, за да ви подпомогне в процеса на годишно приключване, гарантирайки точност и съответствие със законовите изисквания.",
        "bullets": [
          "Подготовка на годишни финансови отчети",
          "Анализ на финансовите резултати",
          "Консултации за подобрения и стратегическо планиране"
        ]
      },
    },
    "seo": {
      "title": "Годишно Приключване на Сметки | Вашата Фирма",
      "metaDescription": "Гарантирайте точност и съответствие с законовите изисквания при годишното приключване на сметки с нашите професионални услуги.",
      "keywords": "годишно приключване, финансови отчети, счетоводни услуги, анализ на резултати, стратегическо планиране"
    }
  },
  {
    "id": "hr-services",
    "name": "Обработка на заплати/ТРЗ услуги",
    "summary": {
      "name": "Обработка на заплати/ТРЗ услуги",
      "description": "Нашият екип предлага всеобхватна подкрепа в областта на трудовите и застрахователните въпроси, помагайки ви да управлявате заплатите и социалните приноси ефективно. Ние сме тук, за да улесним вашия административен товар и да оптимизираме вашите операции в ТРЗ.",
      "icon": "/icons/User.svg",
      "img": "/photos/photo3.webp",
      "link": "/Services/hr-services"
    },
    "pageData": {
      "hero": {
        "title": "Управление на Човешките Ресурси и Заплати",
        "description": "Максимизирайте ефективността на вашите HR и заплатни процеси с нашата професионална подкрепа.",
        "image": "/hero.png"
      },
      "description": {
        "title": "Комплексни HR Услуги",
        "text": "Предоставяме цялостно управление на човешките ресурси и заплати, облекчавайки административния товар и повишавайки удовлетвореността на служителите.",
        "bullets": [
          "Създаване на трудови договори",
          "Обработка на заплати и данъчни декларации",
          "Консултации по трудово и социално законодателство"
        ]
      }
    },
    "seo": {
      "title": "HR и Управление на Заплати | Вашата Фирма",
      "metaDescription": "Оптимизирайте HR процесите и управлението на заплати с нашите интегрирани услуги, предназначени да подобрят ефективността и съответствието.",
      "keywords": "HR услуги, управление на заплати, трудови договори, данъчни декларации, консултации по трудово право"
    }
  },
  {
    "id": "quarterly-service",
    "name": "Тримесечно Обслужване",
    "summary": {
      "name": "Тримесечно Обслужване",
      "description": "Нашето тримесечно счетоводно обслужване е идеално за предприятия, търсещи гъвкавост и надеждност, без да се налага постоянно внимание. Осигурете си спокойствие и съответствие със законовите изисквания с нашите персонализирани счетоводни решения.",
      "icon": "/icons/Time.svg",
      "img": "/photos/photo3.webp",
      "link": "/Services/quarterly-service"
    },
    "pageData": {
      "hero": {
        "title": "Тримесечно Счетоводно Обслужване",
        "description": "Идеално за бизнеси с по-малък обем на операции, нашите тримесечни пакети предлагат гъвкаво и цялостно обслужване.",
        "image": "/hero.png"
      },
      "description": {
        "title": "Включени Услуги в Тримесечния Пакет",
        "text": "Нашите тримесечни услуги са разработени да осигуряват цялостно и периодично обслужване, адаптирано към уникалните нужди на вашето предприятие.",
        "bullets": [
          "Изготвяне на месечни и годишни финансови отчети",
          "Подготовка и подаване на данъчни декларации за данъци и такси",
          "Водене на счетоводство и складово стопанство",
          "Консултации по счетоводни и данъчни въпроси",
          "Поддържане и актуализиране на персоналния регистър"
        ]
      }
    },
    "seo": {
      "title": "Тримесечно Счетоводно Обслужване | Вашата Фирма",
      "metaDescription": "Нашите тримесечни счетоводни услуги предлагат гъвкаво решение за бизнеси с по-малък обем на операции, гарантирайки вашето спокойствие и съответствие.",
      "keywords": "тримесечно счетоводство, счетоводни услуги, финансови отчети, данъчно обслужване, консултации по счетоводство"
    }
  }
  ]


export default defineEventHandler((event) => {

    const query = getQuery(event)
    let service
    if(Object.keys(query).length === 0){
      return services
    }

    if(query.type === "nav"){
      service = services.map(service => {
        return {id : service.id, name : service.name}
      })
    }

    if(query.type === "service"){
      service = services.find(service => service.id === query.id)
      service = { text : service?.pageData, seo : service?.seo }
    }


    return service
    })  